Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/F09C.tmx
Source language: en_us
Languages: zh_cn

source: My Life in Bicycles
zh_cn: 自行车上的五色人生

source: BELGRADE LAKES, Me. - MY Uncle Clarke woke me before dawn with a shake to the shoulder.
zh_cn: 缅因州贝尔格莱德湖 – 黎明将至，克拉克叔叔摇了摇我的肩膀，叫醒了我。

source: He gave me a look that asked, You in?
zh_cn: 他望着我，似乎在问：准备好了？

source: I nodded.
zh_cn: 我点点头。

source: I was in all right.
zh_cn: 是的，我已经准备好了。

source: Ten minutes later, we were on bikes riding through the gray light. We pedaled past sleepy summer homes with hammocks in their side yards, towels hanging from porch railings, inflatable rafts stacked up like pancakes.
zh_cn: 10分钟后，我们骑着自行车，在朦胧的白色辉光中穿行，一幢幢恬静的夏日小屋在我们身旁缓缓后退。小屋的侧院里横着几张吊床，门廊上挂着几条毛巾，充气式皮筏整齐的码在一起，宛如一张张煎饼。

source: This was Rehoboth Beach, Del., August 1968.
zh_cn: 这里是1968年8月，位于特拉华州的里霍伯斯滩。

source: Uncle Clarke (not my real uncle, but my father's best friend from high school) rode every morning at dawn.
zh_cn: 克拉克叔叔(他不是我的亲叔叔，但却是我父亲从中学时代开始最好的朋友)每天早上都会骑车。

source: He had one of those "English" bikes that were all the rage in the 1960s, a Raleigh three-speed with the gear shift on a tiny lever near the rider's right thumb.
zh_cn: 他骑的是在20世纪60年代非常流行的兰令三速自行车，这种车是英国品牌，变速器装在一个靠近骑手右手大拇指的小型操作杆上。

source: I rode a borrowed Sting-Ray belonging to my cousin Martha.
zh_cn: 我骑得则是一部借来的刺鳐牌自行车，这部车归我表亲玛莎所有。

source: Usually Uncle Clarke led an army of us kids on those morning rides, but that day it was just me.
zh_cn: 每天早晨，克拉克叔叔通常会领着我们这一大群孩子出去骑车，但那一天，他只带着我一个人。

source: We rode over to the bay side and then to the boardwalk, its Skee-Ball parlors and salt water taffy machines closed up at that hour.
zh_cn: 我们先骑车来到海边，然后来到了海边的木板路。在那个时候路边的滑雪球(Skee-Ball)游乐屋还没有开门营业，而盐水太妃糖机也没有开始运作。

source: We looked at the ocean and listened to the surf.
zh_cn: 我们看着湛蓝的大海，倾听着碎浪亲吻海岸的声音。

source: The poet Matthew Arnold once called it "the eternal note of sadness," but it sounded all right to me.
zh_cn: 诗人马修·阿诺德曾称之为“奏出悲鸣之曲的永恒音符”，但在我的耳朵里，这种声音并不悲伤。

source: T. S. Eliot's Prufrock laments that his life has been measured out in coffee spoons, but I think I could take a pretty good measure of my own life in bicycle tires.
zh_cn: 托马斯·斯特恩斯·艾略特在作品《普鲁弗洛克的情歌》里哀叹咖啡匙子量走了他的生命，但我却用自行车轮量出了自己的精彩。

source: There was the orange Huffy of childhood that I transformed into something I called Tiger Bike, complete with a furry tail given out at the Esso station during its "Put a Tiger in Your Tank" promotion.
zh_cn: 小时候，有一辆橘色的赫菲自行车经过我的改装之后，成为了我口中的“虎式自行车”，并配备了一条皮制尾巴。这条尾巴是我在埃索石油公司的加油站领到的，当时该公司正打出“在你的油箱里放一只老虎”的促销口号。

source: Later, there was a 10-speed I took to college, where it was stolen from a friend's house.
zh_cn: 后来，我把一辆十速自行车带到了大学，结果在那时，这部车从我朋友的房子里被偷走了。

source: In my 20s, I owned a Lotus racing bike.
zh_cn: 在我20来岁的时候，我拥有了一辆莲花牌竞赛自行车。

source: Once, I got my shoes so hopelessly entangled in its toe clips that I spilled right onto the asphalt of Connecticut Avenue in Washington, D.C.
zh_cn: 有一次，由于鞋子紧紧缠在了自行车踏脚套里，我摔倒在了华盛顿特区康涅狄格大道的柏油路面之上。

source: Now, in my 50s, I have two bikes - a Specialized Secteur for the road, and a hard-core Trek Fuel 70 for the fire roads and logging trails of Kennebec County.
zh_cn: 现在，年逾五旬的我拥有两部自行车：一部闪电牌公路自行车，用于在公路上骑行；一部崔克Fuel 70型山地车，用于在缅因州肯纳贝克县的消防通道和伐木路上骑行。

source: When my sons were in elementary school, there were weeks in summer when they'd jump on their bikes in the morning and disappear down our dirt road with a crew of other boys from the neighborhood.
zh_cn: 我儿子上小学的时候，有一幕会在夏天持续上演几个星期：他们跳上自己的自行车，和住在附近的小伙伴一起沿着泥土路骑行，最终不见了踪影。

source: "Bike patrol," they called themselves.
zh_cn: 他们自称为“自行车巡逻队。”

source: They'd head off to the lake, or to one another's houses, or - who knows? - to secret locations that I, as one of their mothers, will never know.
zh_cn: 他们会去湖边，去彼此的家中，或者是——谁知道呢？去什么我作为其中一个孩子的母亲永远也不会知道的秘密地方。

source: I have several friends who partake in something called "spinning," which is the health-club version of cycling, involving a group of women on stationary bikes who pedal fast, then slow, then fast, as the instructor blasts the kind of music you usually hear in stores that are trying to get 16-year-olds to buy pants, and yells things like, "Feel the burn!"
zh_cn: 我有几个朋友参加了“疾驰”(健身俱乐部对骑行的叫法)，一群骑健身脚踏车的妇女也参加了这一活动。她们骑行的速度先快，再慢，然后再快，而教练则大声地播放音乐，饱含激情地呼喊着。这些音乐你通常会在一些试图驱使16岁的孩子购买短裤的商店里听到。

source: I prefer exercising at least two miles away from any other human being. For me, biking is a solitary activity.
zh_cn: 不过，我更喜欢在离其他人两英里的地方锻炼，因为在我眼中，骑行是一项单人活动。

source: In the Kennebec Highlands, on my mountain bike, I pedal past Kidder Pond, up to the blueberry barrens high atop Vienna Mountain. From there, I watch bald eagles and ospreys, and other birds, whose poop, owing to their diet of berries, stains the gray rocks purple.
zh_cn: 我在肯纳贝克高原(Kennebec Highlands)上骑着山地车，经过基德尔池(Kidder Pond)，骑向维也纳山(Vienna Mountain)高处，专属于蓝莓的领地，我从那里观察秃鹰，鹗，还有其他飞鸟。这些鸟类的粪便将灰白色的岩石染成了紫红色，而采食浆果则是这种粪便的成因。

source: Sometimes I've run into deer and porcupines, and on one memorable occasion, a moose.
zh_cn: 有时候，我会邂逅豪猪和鹿。在一个值得纪念的时刻，我邂逅了一只大角鹿。

source: Another time, I lay with my back against a tree, watching a beaver build a dam in Boody Pond.
zh_cn: 还有一次，我背靠大树，看着一只河狸在布迪池(Boody Pond)边构筑堤坝。

source: Stephen King writes of a solitary childhood encounter with a deer in his story "The Body": "My heart went up into my throat so high that I think I could have put my hand in my mouth and touched it."
zh_cn: 斯蒂芬·金在自己的小说《尸体》中写到了孤独的童年和一只鹿之间的奇遇：“我的心提到了嗓子眼，我想如果把手伸进嘴里就能摸到自己的心脏。”

source: Later, the narrator decides not to tell his friends about what he has seen, to keep it for himself. "The most important things are the hardest to say, because words diminish them."
zh_cn: 随后，故事叙述者决定不把看到的景象告诉自己的朋友，让这段奇遇埋藏在心底。“最重要的事物往往是最难以表达的，因为语言难以全部表达其中的真意。”

source: These are the gifts that I will most miss when, some day in the not-so-distant future, I have to give up biking alone.
zh_cn: 如果不久以后，在未来的某一天，我不得不放弃独自骑行，那么这些美好将是我最为深切的思念。

source: At 56, I'm really too old to be hopping over rocks and fallen trees, an hour or two from help, should anything terrible happen to me, which, odds are, it will.
zh_cn: 我56岁了，由于年龄的关系，我不能再骑车从岩石和倒下的树木上一跃而过。如果我在需要经过1或2个小时才能得到帮助的地方做这种运动，那么我一定会遇到麻烦。

source: Recently, I encountered a bunch of young men who were climbing a mountain trail that I was riding down; one of them looked at me, mud-spattered, sweat-covered, and said, "Whoa! Hard- core!"
zh_cn: 最近，我骑车下山的时候，遇到了一群年轻人，他们正沿着我下山的小径向上攀爬。其中一个人看着泥土溅身，汗流浃背的我说道：“哇，真硬挺！”

source: It wasn't clear whether he was saying this out of admiration, or concern.
zh_cn: 这句话究竟是出于钦佩还是出于担心？答案并不确定。

source: A couple of years after that bike ride with my Uncle Clarke, he and my father had some kind of falling out, and I didn't see him again.
zh_cn: 跟着克拉克叔叔骑了几年车之后，他与我父亲发生了争执，此后我再也没有看见他。

source: I don't think about him very often, except on summer mornings in August, when I'm climbing onto my bike.
zh_cn: 我并没有经常想起他，只有在8月的夏日清晨，我骑车上山的时候，脑海中才会常常浮现克拉克叔叔的身影。

source: That morning in Rehoboth Beach, I saw the first sunrise I can remember.
zh_cn: 那个清晨，我在里霍伯斯滩看到的日出是我能记起的第一抹朝霞。
